---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationOffsetParam
source: html/ff4993ad-2237-2c11-dc9c-96e7644379a4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationOffsetParam Property

"Middle Elevation"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationOffsetParam { get; }
```